Repository: Utodev/ngPAWS
Catalog: installation_aux_files/languages/ngpaws.*.po
Languages: ca, es

source: at GitHub (GPL)
ca: a GitHub (GPL)
es: en GitHub (GPL)

source: Nice icons by Kiranshastry
ca: Bones icones per Kiranshastry

source: Lazarus source code avaliable
ca: Codi font de Lazarus disponible
es: Código fuente Lazarus disponible

source: Help
ca: Ajuda
es: Ayuda

source: New
ca: Nou
es: Nuevo

source: Open
ca: Obre
es: Abrir

# TFMAIN.BOPTIONS.HINT
source: Options
ca: Opcions
es: Opciones

source: Run (F5)
ca: Inicia (F5)

source: Save (Ctrl+S)
ca: Desa (Ctrl+S)

source: Compiler output
ca: Sortida del compilador
es: Mensajes del compilador

source: About ngPAWS
ca: Quant a ngPAWS
es: Acerca de ngPAWS

source: &Close
ca: Tan&ca
es: &Cerrar

source: Close this frame
ca: Tanca aquest marc
es: Cerrar esta ventana

source: &Compile
ca: &Compila
es: &Compilar

source: Compile && &Run
ca: Compila i &inicia
es: Compilar y Ejecuta&r

source: &Connections
ca: &Connexions
es: &Conexiones

source: &Copy
ca: &Copia
es: &Copiar

source: Copy All To Clipboard
ca: Copia-ho tot del portaretalls
es: Copiar todo

source: C&ut
ca: Re&talla
es: Cortar

source: Data
ca: Dades
es: Datos

source: &Definitions
ca: &Definicions
es: &Definiciones

source: &Edit
ca: &Edita
es: &Editar

source: &File
ca: &Fitxer
es: &Archivo

# tfmain.mfind.caption
source: Find
ca: Cerca
es: Buscar

source: &Find next
ca: &Cerca el següent
es: &Buscar siguiente

source: &Help
ca: &Ajuda
es: &Ayuda

source: Help contents
ca: Contingut de l'ajuda
es: Ayuda

source: &Locations
ca: &Localitzacions
es: &Localidades

source: &Messages
ca: &Missatges
es: &Mensajes

source: &New
ca: &Nou
es: &Nuevo

source: New Process
ca: Nou Procés

source: Ob&ject Data
ca: Dades de l'ob&jecte
es: Datos de Ob&jeto

source: &Object Texts
ca: Text de l'&objecte
es: Textos de &Objeto

# TFMAIN.MOPENALLSECTIONS.CAPTION
source: Open &all sections
ca: Obre &totes les seccions
es: Abrir tod&as las secciones

# TFMAIN.MOPENFILE.CAPTION
source: &Open
ca: &Obre
es: &Abrir

source: &Options
ca: &Paràmetres
es: &Opciones

source: Pas&te
ca: Engan&xa
es: Pegar

source: &Processes
ca: &Processos
es: &Procesos

source: &Project
ca: &Projecte
es: &Proyecto

source: Quit
ca: Surt
es: Salir

source: Recent F&iles
ca: F&itxes recents
es: Archivos Recientes

# tfmain.mredo.caption
source: Redo
ca: Refés
es: Rehacer

# tfmain.mreplace.caption
source: Replace
ca: Reemplaça
es: Reemplazar

source: &Save
ca: De&sa
es: &Guardar

source: &System messages
ca: &Missatges del sistema
es: Mensajes del &sistema

source: &Tools
ca: &Eines
es: &Herramientas

# tfmain.mundo.caption
source: Undo
ca: Defés
es: Deshacer

source: &Vocabulary
ca: &Vocabulari
es: &Vocabulario

source: Condact Help
ca: Ajuda dels Condactes
es: Ayuda de condacto

# tfmain.pmcopy.caption
source: Copy
ca: Copia
es: Copiar

# tfmain.pmcut.caption
source: Cut
ca: Retalla
es: Cortar

# tfmain.pmfind.caption
source: Find
ca: Cerca

source: Find next
ca: Cerca el següent

source: Toggle interrupt process mark
ca: Commuta la marca del procés d'interrupció
es: Activar/desactivar marca de interrupción

source: Larger font
ca: Font més grossa
es: Fuente más grande

# tfmain.pmpaste.caption
source: Paste
ca: Enganxa
es: Pegar

# tfmain.pmpuzzlewizard.caption
source: Puzzle Wizard
ca: Assistent de trencaclosques
es: Asistente de puzles

# tfmain.pmreplace.caption
source: Replace
ca: Reemplaça

source: Smaller font
ca: Font més petita
es: Fuente más pequeña

source: &Cancel
ca: &Cancel·la
es: &Cancelar

source: &Ok
ca: &D'acord

# tfoptions.caption
source: Options
ca: Opcions
es: Opciones

source: Delete temp files
ca: Elimina els fitxers temporals
es: Borrar archivos temporales

source: Open all sections on load
ca: Obre totes les seccions al carregar
es: Abrir todas las secciones al cargar

source: Save before run or compile
ca: Desa abans d'iniciar o compilar
es: Grabar antes de ejecutar o compilar

source: Show tool bar
ca: Mostra la barra d'eines
es: Mostrar barra de herramientas

source: Compiler Options
ca: Opcions del compilador
es: Opciones del compilador

source: Editor Options
ca: Opcions de l'editor
es: Opciones del editor

# TFOPTIONS.LABELCOMPILER.CAPTION
source: Compiler
ca: Compilador
es: Compilador

source: Help Base URL
ca: URL base de l'ajuda
es: URL base de ayuda

source: Language
ca: Idioma
es: Idioma

source: Preprocessor
ca: Preprocessador
es: Preprocesador

source: Preprocessor Parameters
ca: Paràmetres del preprocessador
es: Parámetros del preprocesador

source: Start database
ca: Base de dades inicial
es: Base de datos Inicio

# TFPUZZLEWIZARD.BUTTONADDACTION.CAPTION
source: Add
ca: Afegeix
es: Añadir

source: Add Action
ca: Afegeix una acció
es: Añadir Acción

# tfpuzzlewizard.buttonaddcondition.caption
source: Add
ca: Afegeix
es: Añadir

source: Add Condition
ca: Afegeix una condició
es: Añadir Condición

# TFPUZZLEWIZARD.BUTTONNEXT.CAPTION
source: &Next >
ca: &Següent >
es: &Siguiente >

source: < &Previous
ca: < &Anterior
es: < &Anterior

# tfpuzzlewizard.caption
source: Puzzle Wizard
ca: Assistent de trencaclosques
es: Asistente de puzles

source: Include aditional words in failure entries
ca: Inclou paraules addicionals en entrades fallides
es: Incluir palabras adicionales en entradas de fallo

source: Select if entries created to show failure text due to conditions failing to match will include also extra required words or just verb or verb+name
ca: Seleccioneu si les entrades creades per mostrar el text d'error a causa de les condicions que no coincideixen inclouran també paraules addicionals obligatòries o només verb o verb+nom
es: Elija si quiere que las entradas creadas para cuando falla alguna condición requieran también las palabras adicionales o solo verbo+nombre

source: Puzzle is linked to location
ca: El trencaclosque està unit a una localització
es: Puzzle ligado a localidad

source: Choose an action...
ca: Trieu una acció…
es: Elige una acción...

source: Choose a condition...
ca: Trieu una condició…
es: Elige una condición

source: Please specify response for player if this condition is not successful
ca: Especificau una resposta al o la jugadora si no es satisfà aquesta condició
es: Especifique la respuesta para el jugador si la condición no se cumple

source: Enter a location number or identifier where the puzzle happens
ca: Escriviu un número o identificador de localització on hagi de passar el trencaclosques

source: Enter text in case of success
ca: Escriviu el text en cas d'èxit
es: Escriba respuesta en caso de éxito

source: On success
ca: En encertar
es: Éxito

# tfpuzzlewizard.groupboxloc.caption
source: Location
ca: Localització
es: Localidad

source: Fill in this box if this puzzle can only be solved in a given location
ca: Seleccioneu si el trencaclosques només es pot resoldre a certa localització
es: Indique la localidad donde se puede resolver el puzle

# TFPUZZLEWIZARD.GROUPBOXVOC.CAPTION
source: Vocabulary
ca: Vocabulari
es: Vocabulario

source: Fill in this box to determine which words will the player have to type for this puzzle to get triggered
ca: Seleccioneu per determinar amb quines paraules s'han d'escriure per accionar el trencaclosques
es: Rellene esta caja para determinar que palabras tendrá que escribir el jugador para solucionar el puzle.

source: Second Adjective (optional)
ca: Segon adjectiu (opcional)
es: Segundo Adjetivo (opcional)

source: Adjective (optional)
ca: Adjectiu (optional)
es: Adjetivo (opcional)

source: Adverb (optional)
ca: Adverbi (opcional)
es: Adverbio (opcional)

# TFPUZZLEWIZARD.LABELCONDTOF.CAPTION
source: Message if condition fails
ca: Missatge si la condició falla

source: In case of success, please specify text output, and add any other actions that should be performed .
ca: En cas d'èxit, especifiqueu un text de sortida i afegiu una altra acció que s'hagi de fer.

source: Specify what player should type to succeed on puzzle. Also, if he/she needs to be in an specific location
ca: Especifiqueu què s'ha d'escriure per solucionar el trencaclosques. També, si hi ha de ser a una localització específica
es: Especifique la órden del jugador, y la localidad (si ha de ser una concreta), para solucionar el puzzle.

source: If any additional conditions should be met for player success, add them here.
ca: Si s'ha de reunir una condició addicional per resoldre, afegiu-la aquí
es: Si se deben cumplir condiciones adicionales, añádalas aquí.

source: Puzzle code has been generated, please click "Finish" to add it to your game code.
ca: El codi del trencaclosques s'ha general, cliqueu «Acabar» per afegir-ho al codi del joc.
es: El código del puzle ha sido generado, por favor haga click en "Finalizar" para incluirlo.

# TFPUZZLEWIZARD.LABELLOCATIONTOF.CAPTION
source: Response if not at right location
ca: Contestació si no s'hi és a la localització correcta

# TFPUZZLEWIZARD.LABELLOCATIONTOF.HINT
source: Response to player if he/she tries to perform this action in other location
ca: Contestació si el o la jugadora prova de fer aquesta acció a una altra localització
es: Respuesta al jugador si intenta realizar la acción en otra localidad

source: Noun (optional)
ca: Nom (opcional)
es: Nombre (opcional)

source: Second noun(optional)
ca: Segon nom (opcional)
es: Segundo nombre (opcional)

source: Preposition (optional)
ca: Preposició (opcional)
es: Preposición (opcional)

# TFPUZZLEWIZARD.LABELTOS.CAPTION
source: Response on puzzle success
ca: Resposta en resoldre el trencaclosques

source: Delete
ca: Elimina
es: Borrar

source: Move down
ca: Mou abaix
es: Bajar

source: Move up
ca: Mou adalt
es: Subir

source: Actions
ca: Accions
es: Acciones

source: Success and options
ca: Èxit i opcions
es: Éxito y opciones

source: Conditions
ca: Condicions
es: Condiciones

source: Vocabulary & Location
ca: Vocabulari i localitzacions
es: Vocabulario y Localidad

source: Cancel
ca: Cancel·la
es: Cancelar

source: Ok
ca: D'acord

# tfsearchreplace.caption
source: Search
ca: Cerca
es: Buscar

source: Case Sensitive
ca: Coincidència maj./minúscules
es: Sensible a mayúsculas

source: Only from cursor
ca: Només des del cursor
es: Desde el cursor

source: Only in selection
ca: Només en la selecció
es: Solo en selección

# TFSEARCHREPLACE.CHECKREPLACE.CAPTION
source: Replace
ca: Reemplazar
es: Reemplazar

source: Whole Words only
ca: Només paraules senceres
es: Solo palabras completas

# TFSEARCHREPLACE.LABELSEARCH.CAPTION
source: Search
ca: Cerca
es: Buscar

source: Choose an action... Object <....> appears Object <....> disappears Object <....> appears at location <....> Flag <....> is increased by <....> Flag <....> is decreased by <....> Flag <....> value is set to <....> Destroy connection in direction <....> Set connection in direction <....> to location <....>
ca: Trieu una acció… Objecte <…> apareix Objecte <…> desapareix Objecte <…> apareix a la localització <…> Flag <…> s'incrementa en <…> Flag <…> es disminueix en <…> Flag <…> el valor torna <…> Destrueix la connexió en la direcció <…> Defineix la connexió en la direcció <…> a la localització <…>

source: Please specify an adjetive for player order
ca: Especifiqueu un adjectiu per l'ordre del o la jugadora
es: Por favor especifique un adjetivo para la orden del jugador

source: Please specify an adjetive for second noun player order
ca: Especifiqueu un adjectiu per la segona ordre del o la jugadora
es: Por favor especifique un adjetivo para el segundo nombre de la orden del jugador

source: Please specify an adverb for player order
ca: especifiqueu un adverbi per l'ordre del o la jugadora
es: Por favor especifique un adverbio para la orden del jugador

source: Browser not found. Please check Tools/Options and set proper path for your favorite browser.
ca: No s'ha trobat cap navegador. Aneu a Eines/Paràmetres i configureu la ruta al vostre preferit.
es: Navegador no encontrado.

source: Compiler not found, please check options to set valid path
ca: No s'ha trobat el compilador, comproveu als paràmetre que la ruta és vàlida
es: Compilador no encontrado, por favor revise ruta en Herramientas/Opciones

source: OK. Ready to run.
ca: D'acord. Llest per iniciar.
es: OK. Listo para ejecutar.

source: Choose a condition... Player carries object <....> Player wears object <....> Player does not carry object <....> Object <....> is present Object <....> is absent Object <....> is at location <....> Object <....> is not at location <....> Flag <....> value is <....> Flag <....> value is not <....> Flag <....> value is greater than <....> Flag <....> value is less than <....>
ca: Trieu una condició… El o la jugadora duu l'Objecte <…> El o la jugadora duu posat l'Objecte <…> El o la jugadora no duu l'Objecte <…> L'Objecte <…> és present l'Objecte <…> és absent L'Objecte <…> és a la localització <…> L'Objecte <…> no és a la localització <…> El valor del Flag <…> és <…> El valor del Flag <…> no és <…> El valor del Flag <…> és major que <…> El valor del Flag <…> és menor que <…>
es: Elija una condición... El jugador lleva el objeto <....> El jugador lleva puesto el objeto <....> El jugador no lleva el objeto <....> El objeto <....> está presente El objeto <....> está ausente El objeto <....> está en la localidad <....> El objeto <....> no está en la localidad <....> El valor del flag <....> es <....> El valor de flag <....> no es <....> El valor del flag <....> es mayor que <....> El valor del flag <....> es menor que <....>

source: NewAdventure.txp
ca: NovaAventura.txp
es: NuevaAventura.txp

source: Direction
ca: Direcció
es: Dirección

source: Please enter a valir direction verb
ca: Escriviu una adreça vàlida

source: >> File has been loaded. To open sections use the "Project" menu <<
ca: >> S'ha carregat el fitxer. Per obrir les seccions utilitzeu el menú «Projecte» <<
es: El fichero ha sido cargado. Para abrir las opciones use el menú "Proyecto"

source: File not found
ca: No s'ha trobat el fitxer
es: Archivo no encontrado

source: &Finish
ca: &Acaba
es: &Finalizar

source: Please enter number or txtpaws label of a flag
ca: Escriviu un número o una etiqueta del txtpaws d'un Flag
es: Por favor introduzca el número o etiqueta txtpaws del flag

source: index.html file not found.
ca: No es troba el fitxer «index.html».
es: No se encontró archivo index.html.

source: Not a valid TXP/SCE file
ca: Fitxer TXP/SCE invàlid
es: Fichero TXP/SCE no válido

source: Invalid Process Number
ca: Número de Procés invàlid
es: Número de proceso no válido

source: Invalid section
ca: Secció invàlida
es: Sección no válida

source: OS Default English Spanish
ca: Del sistem Anglès Espanyol

# uglobals.s_location
source: Location
ca: Localitzacions
es: Localidad

source: Please enter number or txtpaws label of a location
ca: Escriviu un número o una etiqueta del txtpaws d'una localització
es: Por favor introduzca el número o etiqueta txtpaws de la localidad

source: Please specify a location if puzzle is linked to location
ca: Especifiqueu una localitzación si el trencaclosques està connectat a una localització
es: Por favor especifique la localidad a la que está ligado el puzle

source: Please specify a text on failute is player is not at specified location
ca: Especifiqueu un text per error si el o la jugadora no és a la localització definida
es: Por favor especifique un texto en caso de fallo si el jugador no está en la localidad

source: Process &
ca: Procés &
es: Proceso &

source: &Response
ca: &Resposta
es: &Respuestas

source: One or more files required to create a new game are missing, please check your installation.
ca: Falta un o més fitxers necessaris per a crear un joc nou, comproveu la vostra instal·lació.
es: Uno o más ficheros necesarios para crear una nueva aventura no se encuentran, por favor compruebe su instalación

# uglobals.s_next_message
source: &Next >
ca: &Següent >
es: &Siguiente >

source: Please specify a second noun for player order
ca: Especifiqueu un segon nom per l'ordre del o la jugadora
es: Por favor especifique un segundo nombre para la orden del jugador

source: Please specify a noun for player order
ca: Especifiqueu un nom per l'ordre del o la jugadora
es: Por favor especifique un nombre para la orden del jugador

source: Mark of end of puzzle not found.
ca: No s'ha trobat la marca de final de trencaclosques.
es: No se encontró la marca de fin de puzle

source: Please open some section from the "Project" menu in order to use this feature.
ca: Obriu alguna secció del menú «Projecte» per usar aquesta funció.
es: Por favor abra alguna sección desde el menú "Project" para usar esta funcionalidad.

source: Object
ca: Objecte
es: Objeto

source: Please enter number or txtpaws label of an object
ca: Escriviu un número o una etiqueta d'un objecte
es: Por favor especifique el número o etiqueta txtpaws para el objeto

source: Please fill in fields
ca: Ompliu els camps
es: Por favor rellene los campos

source: Please select a condition
ca: Seleccioneu una condició
es: Por favor seleccione una condición

source: Preprocessor not found, please check options to set valid path
ca: No s'ha trobat el prepocessador, comproveu als paràmetres que la ruta és vàlida
es: Preprocesador no encontrado, por favor revise la ruat en las opciones

source: Please specify a preposition for player order
ca: Especifiqueu una preposició per a l'ordre del o la jugadora
es: Por favor especifique una preposición para la orden del jugador

source: ; Please don't remove the 'end of puzzle' mark below. Removing it may lead to code corruption
ca: ; No elimineu la marca de «final del trencaclosques» a continuació. Eliminar-la pot provocar la corrupció del codi
es: ; Por favor no borre la marca de "fin de puzzle" de abajo. Hacerlo puede llevar a corrupción del código.

source: ; Automatically generated puzzle, please right click the token below and select "Puzzle Wizard" to edit it
ca: ; Trencaclosques generat automàticament, cliqueu amb el botó dret l'element següent i seleccioneu «Assistent de trencaclosques» per editar-lo
es: ; Puzle generado automáticamente, haga click derecho sobre el token con el ratón y selecciona "Asistente de Puzles" para editarlo

source: ; Don't delete the token
ca: ; No elimineu l'element
es: ; No borre el token

source: Some changes may have not been saved. Are you sure?
ca: No s'han desat alguns canvis Voleu continuar?

source: There is already another process marked as interrupt process. Marking this one will deactivate the other. Are you sure?
ca: Ja hi ha un altre procés marcat com a procés d'interrupció. Si marqueu aquest, es desactivarà l'altre. Voleu continuar?

source: not found.
ca: no s'ha trobat
es: no encontrado

source: Connections
ca: Connexions
es: Conexiones

source: Definitions
ca: Definicions
es: Definiciones

source: Locations
ca: Localitzacions
es: Localidades

source: User Messages
ca: Missatges d'usuari
es: Mensajes de usuario

source: Object Data
ca: Dades d'Objecte
es: Datos de Objectos

source: Objects
ca: Objectes
es: Objetos

source: Process
ca: Processos
es: Proceso

source: Response
ca: Respostes
es: Respuestas

source: System Messages
ca: Missatges del sistema
es: Mensajes del sistema

# uglobals.s_section_vocabulary
source: Vocabulary
ca: Vocabulari
es: Vocabulario

source: Running compiler...
ca: Compilador en marxa…
es: Ejecutando compilador...

source: Running preprocessor...
ca: Preprocessador en marxa…
es: Ejecutando preprocesador...

source: Start database not found, please check options to set valid path
ca: No s'ha trobat la base de dades d'inici, comproveu als paràmetres si la ruta és vàlida

source: Too many processes
ca: Massa processos
es: Demasiados procesos

source: Please specify a text on success
ca: Especifiqueu un text d'èxit
es: Por favor especifique un texto en caso de éxito

source: Unexpected condition
ca: Condició inesperada
es: Condición inesperada

source: Value
ca: Valor
es: Valor

source: Please enter a integer positive value or zero
ca: Escriviu un valor enter positiu o zero
es: Por favor introduza un valor entero positivo o cero

source: Please specify a verb for player order
ca: Especifiqueu un verb per l'ordre del o la jugadora
es: Por favor especifique un verbo para la orden del jugador

source: Please select an empty zone in the response table or the token of a previous puzzle. If you selected a token and you see this message, probably the token was modified.
ca: Seleccioneu una zona buida a la taula de respostes o el token d'un trencaclosques anterior. Si n'heu seleccionat un i veieu aquest missatge, probablement el token s'ha modificat.
es: Por favor seleccione una zona vacía en la tabla de respuestas, o el token de otro puzzle. Si seleccionó un token y ve este mensaje, probablemente el token has sido modificado.

source: Compiler, Preprocessor and/or start database not found. Please check paths in the "Compiler" tab in Tools/Options menu.
ca: No s'ha trobat el compilador, el preprocessador, i/o la base de dades inicial. Comproveu al menú Eines/paràmetres a la pestanya «compilador»

# TFPUZZLEWIZARD.LABELVERB.CAPTION
source: Verb
es: Verbo
